{
  "backend/main.mo": "Main ICP actor implementing a BEAST RIDE e-commerce backend with product, category, collection, order, and user profile management, using role-based access control (admin/user) and blob storage mixins.",
  "backend/migration.mo": "Trivial state migration module with empty old/new state types and an identity migration function.",
  "feature_evidence.json": "Feature evidence report mapping the admin Google-only Internet Identity login feature to its implementation files and associated components/tests.",
  "frontend-file-summaries.txt": "Auto-generated JSON summaries of all frontend source files, describing each component, hook, context, and style file in the BEAST RIDE frontend.",
  "frontend/index.css": "Tailwind base CSS with OKLCH design token CSS variables for light and dark themes covering background, foreground, card, sidebar, chart, and destructive colors.",
  "frontend/index.html": "Minimal HTML entry point for the BEAST RIDE React app, mounting the root div and loading the main TSX module.",
  "frontend/src/App.tsx": "TanStack Router setup defining routes for Home, Collection, ProductDetail, and Admin pages, wrapped in CartProvider and a shared Layout.",
  "frontend/src/components/admin/CategoriesCollectionsSection.tsx": "An admin panel section with two sub-panels for managing categories and collections, supporting add, edit, delete, and product assignment operations with inline forms and confirmation dialogs.",
  "frontend/src/components/admin/GoogleLoginScreen.tsx": "Renders a styled admin login screen with a Google sign-in button, loading state, and error display, using a dark theme with red accents.",
  "frontend/src/components/admin/OrdersSection.tsx": "Displays a table of all orders with status badges and allows admins to update each order's status via a dropdown menu.",
  "frontend/src/components/admin/ProductFormModal.tsx": "Modal form for adding or editing a product, with fields for name, price, description, category, image, and inventory, wired to add/update mutations.",
  "frontend/src/components/admin/ProductsSection.tsx": "Admin section that lists all products in a table with options to add, edit, or delete each product, using confirmation dialogs for deletion.",
  "frontend/src/components/AdminSidebar.tsx": "Sticky admin sidebar with navigation items (Orders, Products, Categories & Collections), active-state red highlight, principal display, and logout button.",
  "frontend/src/components/AnimatedSection.tsx": "Wrapper component that triggers a fade-in-up CSS animation when the section enters the viewport, with optional delay.",
  "frontend/src/components/CartDrawer.tsx": "Slide-in cart drawer supporting item quantity management, free shipping progress bar, Internet Identity login-gated checkout, and order creation via mutation hook with toast feedback.",
  "frontend/src/components/CategorySplit.tsx": "Renders a two-panel split section for 'Bike Accessories' and 'Car Performance' categories, each as a clickable image card that navigates to the filtered shop page.",
  "frontend/src/components/CinematicParallax.tsx": "Displays a full-width parallax banner with a night-road background image and an animated 'DOMINATE THE ROAD' heading that triggers on intersection.",
  "frontend/src/components/FeaturedProductsCarousel.tsx": "A touch-enabled carousel showcasing featured products fetched via React Query, with scale/opacity effects for adjacent cards and prev/next navigation buttons.",
  "frontend/src/components/FilterSidebar.tsx": "A sidebar component that renders a category filter list (All, Bike Accessories, Car Performance) with active-state highlighting and an onChange callback.",
  "frontend/src/components/Footer.tsx": "Site footer with Shop and Support link columns, social media icon buttons, and a copyright line, styled with the brand's dark/red theme.",
  "frontend/src/components/Header.tsx": "Fixed top navigation header with scroll-aware styling, desktop nav links, a cart icon with item count badge, and a hamburger menu that opens MobileNav.",
  "frontend/src/components/HeroSection.tsx": "Full-viewport hero section with a background image, gradient overlays, animated red glow, headline text, and a 'Shop Performance' CTA button.",
  "frontend/src/components/InstagramCommunity.tsx": "Displays a 4-image community grid with Instagram overlay icons and an animated section header encouraging users to tag the brand.",
  "frontend/src/components/Layout.tsx": "Root layout wrapper that composes Header, Footer, CartDrawer, and a Toaster notification provider around page children.",
  "frontend/src/components/MobileNav.tsx": "A slide-in mobile navigation drawer with an overlay, logo, close button, and navigation links for Home, Shop All, and product categories.",
  "frontend/src/components/PerformanceHighlight.tsx": "A section component displaying three animated feature cards ('Engineered for Speed', 'Built to Last', 'Rider Approved') with custom SVG icons and hover effects.",
  "frontend/src/components/ProductCard.tsx": "A product card component that displays product image, category, name, and price, with navigation to the product detail page and an add-to-cart button.",
  "frontend/src/components/ProductTabs.tsx": "A tabbed product detail component with animated indicator showing Description, Specifications, and Shipping tabs for a given product.",
  "frontend/src/components/RelatedProducts.tsx": "Displays a horizontally scrollable row of related products filtered by category, falling back to other products if none match, with skeleton loading states.",
  "frontend/src/components/Reviews.tsx": "A testimonials section rendering a grid of four hardcoded customer review cards with star ratings, review text, reviewer name, and product name.",
  "frontend/src/context/CartContext.tsx": "Provides a React context for cart state management, including add, remove, update quantity, clear, and open/close drawer operations, plus computed subtotal and free-shipping progress.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an authenticated or anonymous backend actor using the user's Internet Identity, and invalidates dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and hook for Internet Identity authentication, managing login/logout state, identity persistence, and AuthClient creation with configurable options.",
  "frontend/src/hooks/useIntersectionObserver.ts": "Custom hook that uses IntersectionObserver to track whether a referenced element is in the viewport, with configurable threshold, rootMargin, and triggerOnce options.",
  "frontend/src/hooks/useMutations.ts": "Defines TanStack Query mutation hooks for CRUD operations on orders, products, categories, and collections, each invalidating relevant query caches on success.",
  "frontend/src/hooks/useQueries.ts": "Defines TanStack Query hooks for fetching products, categories, collections, and orders from the backend actor, with appropriate cache and enabled conditions.",
  "frontend/src/hooks/useScrollPosition.ts": "Custom hook that tracks the window's vertical scroll position using a requestAnimationFrame-throttled scroll event listener.",
  "frontend/src/index.css": "Global stylesheet that imports Barlow fonts, configures Tailwind layers, defines CSS custom properties for the dark Beast Ride theme, and declares reusable component classes like beast-btn and metal-text.",
  "frontend/src/main.tsx": "Application entry point that renders the React app wrapped with TanStack QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/Admin.tsx": "Admin dashboard page that gates access behind Internet Identity authentication, showing a login screen or a sidebar-driven layout with orders, products, and categories sections.",
  "frontend/src/pages/Collection.tsx": "Product collection page that displays all products in a filterable grid, reading an initial category from URL search params and supporting sidebar-based category filtering.",
  "frontend/src/pages/Home.tsx": "Home page component that composes the main landing page by rendering sections: HeroSection, CategorySplit, FeaturedProductsCarousel, PerformanceHighlight, CinematicParallax, Reviews, and InstagramCommunity.",
  "frontend/src/pages/ProductDetail.tsx": "Product detail page that fetches a product by ID from the URL, displays its image, category, title, price, quantity selector, and add-to-cart button, with loading skeletons and a not-found fallback.",
  "frontend/src/utils/urlParams.ts": "Utility module providing functions to read URL query parameters (supporting both standard and hash-based routing), persist them to sessionStorage, retrieve or clear them, and strip sensitive params from the URL hash without reloading.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining dark mode, custom brand colors (Beast Ride tokens), Barlow font families, box shadows, and keyframe animations, with typography, container-queries, and animate plugins enabled.",
  "project_state.json": "Project state metadata file tracking the e-commerce app's version, architectural notes, existing features, and pending feature requests including Google/Internet Identity admin auth and Motoko backend principal-based access control."
}