{
  "backend/main.mo": "Main Motoko actor for the BEAST RIDE backend, defining data types and CRUD operations for products, categories, collections, orders, and user profiles, with role-based access control via MixinAuthorization and blob storage via MixinStorage.",
  "backend/migration.mo": "Trivial migration module that accepts an empty old state and returns an empty new state, serving as a no-op schema migration placeholder.",
  "feature_evidence.json": "Feature evidence report linking the 'Claim Admin Access' first-load flow on the Admin page to its implementation file and associated components/test IDs.",
  "frontend-file-summaries.txt": "Pre-generated JSON summaries of all frontend source files, describing each component, hook, page, and style file in the BEAST RIDE frontend.",
  "frontend/index.css": "Base Tailwind CSS entry point defining OKLCH CSS custom property tokens for light and dark themes, covering background, foreground, primary, sidebar, and chart colors.",
  "frontend/index.html": "Minimal HTML shell for the BEAST RIDE React SPA, mounting the app into a root div and loading the Vite entry script.",
  "frontend/src/App.tsx": "Root React component that sets up TanStack Router with routes for Home, Shop, ProductDetail, Admin, and OrderConfirmation, all wrapped in CartProvider and a shared Layout.",
  "frontend/src/components/admin/CategoriesCollectionsSection.tsx": "Admin panel section for managing categories and collections, including CRUD operations and product assignment to collections via forms and dialogs.",
  "frontend/src/components/admin/GoogleLoginScreen.tsx": "Displays a styled admin login screen with a Google sign-in button using Internet Identity, handling loading and error states.",
  "frontend/src/components/admin/OrdersSection.tsx": "Admin orders table that lists all orders with customer details, address, items, payment method, and allows updating order status via a dropdown.",
  "frontend/src/components/admin/ProductFormModal.tsx": "Modal form for adding or editing a product, with fields for name, price, description, category, image, and inventory, using add/update mutations.",
  "frontend/src/components/admin/ProductsSection.tsx": "Admin products table displaying all products with image, name, category, price, and inventory, supporting add, edit, and delete actions.",
  "frontend/src/components/admin/ResetAdminDialog.tsx": "Empty file with no content.",
  "frontend/src/components/AdminGuard.tsx": "Pass-through wrapper component that previously guarded admin routes but now delegates all authentication and authorization to the Admin page itself.",
  "frontend/src/components/AdminSidebar.tsx": "Sticky dark sidebar for the admin dashboard with navigation items (Orders, Products, Categories), active-state highlighting, principal display, and a logout button.",
  "frontend/src/components/AnimatedSection.tsx": "Wrapper div that applies a fade-in-up CSS animation when the element enters the viewport, using the useIntersectionObserver hook with optional delay support.",
  "frontend/src/components/CartDrawer.tsx": "Slide-in cart drawer with multi-step checkout flow covering cart review, shipping form with validation, payment method selection, and order submission via the useCreateOrder mutation.",
  "frontend/src/components/CategorySplit.tsx": "Renders a two-panel split section for 'Bike Accessories' and 'Car Performance' categories, each with a background image, gradient overlay, animated border, and a click handler that navigates to the filtered shop page.",
  "frontend/src/components/CheckoutStepIndicator.tsx": "Displays a two-step checkout progress indicator (Shipping and Payment) with visual states for active, completed, and inactive steps using icons and colored styling.",
  "frontend/src/components/CinematicParallax.tsx": "A parallax-style full-width section with a night-road background image and a large animated headline 'DOMINATE THE ROAD' that triggers a CSS animation when scrolled into view.",
  "frontend/src/components/FeaturedProductsCarousel.tsx": "A horizontally scrollable product carousel fetching all products via a query hook, supporting touch swipe and button navigation with scale/opacity effects for adjacent cards.",
  "frontend/src/components/FilterSidebar.tsx": "A sidebar component that renders a category filter list (All, Bike Accessories, Car Performance) with active state highlighting and an onChange callback.",
  "frontend/src/components/Footer.tsx": "Site footer with the brand logo, three-column layout for Shop links, Support items, and social media icon buttons, plus a copyright line.",
  "frontend/src/components/Header.tsx": "Fixed top navigation header that transitions styling on scroll, includes desktop nav links, a cart icon with item count badge, and a hamburger menu that opens a MobileNav drawer.",
  "frontend/src/components/HeroSection.tsx": "Full-viewport hero section with a background image, gradient overlays, a pulsing red glow, headline text, and a CTA button that navigates to the shop page.",
  "frontend/src/components/InstagramCommunity.tsx": "Displays a community section with a 2x4 grid of Instagram-style community images, each with an Instagram icon overlay on hover, wrapped in animated entrance sections.",
  "frontend/src/components/Layout.tsx": "Root layout wrapper that composes Header, Footer, CartDrawer, and a Toaster notification component around page children with a dark background.",
  "frontend/src/components/MobileNav.tsx": "Slide-in mobile navigation drawer with an overlay, site logo, close button, and links to main shop categories.",
  "frontend/src/components/PaymentMethodSelector.tsx": "Radio-style selector component for choosing between COD, UPI, and Card payment methods with styled active/inactive states.",
  "frontend/src/components/PerformanceHighlight.tsx": "Marketing section displaying three animated feature cards (Speed, Durability, Rider Approved) with custom SVG icons under a 'Built Different' heading.",
  "frontend/src/components/ProductCard.tsx": "Card component displaying a product image, category, name, price, and an add-to-cart button; clicking the card navigates to the product detail page.",
  "frontend/src/components/ProductTabs.tsx": "Tabbed UI for a product detail page showing Description, Specifications, and Shipping info with an animated active-tab indicator.",
  "frontend/src/components/RelatedProducts.tsx": "Horizontally scrollable row of ProductCards filtered by the current product's category, falling back to other products if none match.",
  "frontend/src/components/Reviews.tsx": "Static testimonials section rendering a grid of four customer review cards with star ratings, review text, and product attribution.",
  "frontend/src/context/CartContext.tsx": "React context providing cart state and actions (add, remove, update quantity, clear, open/close) with computed subtotal, item count, and free shipping progress.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches a backend actor using React Query, supporting both anonymous and authenticated (Internet Identity) usage, and invalidates dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an InternetIdentityProvider context and useInternetIdentity hook for managing ICP Internet Identity authentication, including login, logout, and identity state tracking.",
  "frontend/src/hooks/useIntersectionObserver.ts": "Custom hook that uses IntersectionObserver to track whether a referenced DOM element is in the viewport, with support for threshold, rootMargin, and triggerOnce options.",
  "frontend/src/hooks/useMutations.ts": "Defines React Query mutation hooks for backend write operations including admin access claiming, order status updates, and CRUD operations for products and categories.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching backend data including products, categories, collections, orders, and admin status checks.",
  "frontend/src/hooks/useScrollPosition.ts": "Custom hook that tracks the window's vertical scroll position using a requestAnimationFrame-throttled scroll event listener.",
  "frontend/src/index.css": "Global stylesheet that imports Barlow fonts, configures Tailwind, defines CSS custom properties for the dark 'Beast Ride' theme, and declares reusable component styles like beast-btn and metal-text.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app with QueryClientProvider and InternetIdentityProvider wrappers around the root App component.",
  "frontend/src/pages/Admin.tsx": "Admin dashboard page that handles Internet Identity authentication, admin status verification, and renders section-based admin UI (orders, products, categories) with a sidebar. Also supports bootstrapping the first admin via a claim-access flow.",
  "frontend/src/pages/AdminLogin.tsx": "Empty file with no content.",
  "frontend/src/pages/Collection.tsx": "Product collection/shop page that displays all products in a filterable grid, supporting category filtering via URL search params and a sidebar component.",
  "frontend/src/pages/Home.tsx": "Home page that composes multiple section components (hero, category split, featured carousel, performance highlight, parallax, reviews, Instagram community) into a single landing page.",
  "frontend/src/pages/OrderConfirmation.tsx": "Order confirmation page that reads order data from sessionStorage and displays a summary of the confirmed order including items, shipping address, payment method, and totals.",
  "frontend/src/pages/ProductDetail.tsx": "Product detail page that fetches and displays a single product by ID with image, description, quantity selector, add-to-cart functionality, tabs, and related products.",
  "frontend/src/utils/urlParams.ts": "Utility module providing helper functions for reading, storing, and clearing URL parameters from both query strings and hash-based routes, with sessionStorage persistence support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration for the Beast Ride Admin frontend, extending the default theme with custom brand colors (beast tokens), fonts (Barlow), shadows, keyframe animations, and enabling typography, container-queries, and animate plugins.",
  "project_state.json": "Tracks the current project state (version 3) for the Beast Ride Admin Web3/ICP app, recording existing features, known issues around persisted admin principal IDs, and pending action requests to reset/clear the admin slot on fresh deployments."
}