{
  "backend/main.mo": "Main Motoko actor for the BEAST RIDE backend, defining data types and CRUD operations for products, categories, collections, orders, and user profiles, with role-based access control via MixinAuthorization and blob storage via MixinStorage.",
  "feature_evidence.json": "Feature evidence report confirming that the admin dashboard frontend correctly passes authenticated identity to admin-only backend methods, with hooks gated on valid authentication, referencing useQueries.ts and Admin.tsx.",
  "frontend-file-summaries.txt": "A JSON document containing short summaries of all frontend source files, describing the purpose of each component, hook, page, and style file in the BEAST RIDE frontend.",
  "frontend/index.css": "Base Tailwind CSS entry file defining OKLCH CSS custom properties for light and dark theme color tokens used throughout the shadcn-ui component system.",
  "frontend/index.html": "Minimal HTML shell for the BEAST RIDE React SPA, mounting the app at #root and loading the Vite entry point src/main.tsx.",
  "frontend/src/App.tsx": "Root React component that sets up TanStack Router with routes for Home, Collection, ProductDetail, Admin, and OrderConfirmation pages, all wrapped in CartProvider and a shared Layout.",
  "frontend/src/components/admin/CategoriesCollectionsSection.tsx": "Admin panel section for managing categories and collections, including CRUD operations and product-to-collection assignment with inline forms and confirmation dialogs.",
  "frontend/src/components/admin/GoogleLoginScreen.tsx": "Styled login screen component for the admin dashboard that prompts users to authenticate via Google through Internet Identity.",
  "frontend/src/components/admin/OrdersSection.tsx": "Admin orders table that displays all orders with customer details, address, items, and payment info, and allows updating order status via a dropdown.",
  "frontend/src/components/admin/ProductFormModal.tsx": "Modal form component for adding or editing a product, with fields for name, price, description, category, image, and inventory, using add/update mutations.",
  "frontend/src/components/admin/ProductsSection.tsx": "Admin products table listing all products with image, name, category, price, and inventory, supporting add, edit, and delete actions via modals and confirmation dialogs.",
  "frontend/src/components/AdminSidebar.tsx": "Sticky admin sidebar component with navigation items for Orders, Products, and Categories sections, displaying the authenticated principal and a logout button.",
  "frontend/src/components/AnimatedSection.tsx": "Wrapper component that applies a fade-in-up CSS animation when the section enters the viewport, using the useIntersectionObserver hook with optional delay.",
  "frontend/src/components/CartDrawer.tsx": "Slide-in cart drawer with multi-step checkout flow including shipping form validation, payment method selection, and order creation via the useCreateOrder mutation hook.",
  "frontend/src/components/CategorySplit.tsx": "Renders a two-panel split section for 'Bike Accessories' and 'Car Performance' categories, each with an image, gradient overlay, animated border, and a navigation link to the filtered shop page.",
  "frontend/src/components/CheckoutStepIndicator.tsx": "Displays a two-step checkout progress indicator (Shipping and Payment) with completed, active, and inactive visual states using icons and colored borders.",
  "frontend/src/components/CinematicParallax.tsx": "A parallax-style full-width section with a night road background image, dark overlay, and an animated 'DOMINATE THE ROAD' heading that triggers on scroll intersection.",
  "frontend/src/components/FeaturedProductsCarousel.tsx": "A horizontally scrollable product carousel with scale/opacity effects, touch swipe support, prev/next navigation buttons, and loading skeletons, fetching products via a custom hook.",
  "frontend/src/components/FilterSidebar.tsx": "A sidebar component that renders category filter buttons (All, Bike Accessories, Car Performance) with active highlight styling, calling an onChange callback on selection.",
  "frontend/src/components/Footer.tsx": "Site footer with Shop and Support navigation links, social media icon buttons (Instagram, Facebook, X, YouTube), a logo, and a dynamic copyright year.",
  "frontend/src/components/Header.tsx": "Fixed top navigation header that transitions from transparent to opaque on scroll, includes desktop nav links, a cart icon with item count badge, and a hamburger menu for mobile.",
  "frontend/src/components/HeroSection.tsx": "Full-viewport hero section with a background image, gradient overlays, animated red glow, large 'RIDE THE BEAST' heading, and a CTA button navigating to the shop.",
  "frontend/src/components/InstagramCommunity.tsx": "Displays a 4-image community grid with Instagram overlay icons, animated entrance via AnimatedSection, and a header prompting users to tag the brand in their posts.",
  "frontend/src/components/Layout.tsx": "Root layout component that wraps pages with a Header, Footer, CartDrawer, and a styled Toaster notification provider on a dark background.",
  "frontend/src/components/MobileNav.tsx": "Slide-in mobile navigation drawer with an overlay, site logo, close button, and navigation links to main shop categories.",
  "frontend/src/components/PaymentMethodSelector.tsx": "Radio-button-style selector for choosing between COD, UPI, and Card payment methods, with styled active/inactive states.",
  "frontend/src/components/PerformanceHighlight.tsx": "Marketing section displaying three animated feature cards (Speed, Durability, Rider Approval) with custom SVG icons under a 'Built Different' heading.",
  "frontend/src/components/ProductCard.tsx": "Card component displaying a product's image, category, name, price, and an add-to-cart button, navigating to the product detail page on click.",
  "frontend/src/components/ProductTabs.tsx": "Tabbed panel for a product detail page showing Description, Specifications, and Shipping info with an animated active-tab underline indicator.",
  "frontend/src/components/RelatedProducts.tsx": "Horizontally scrollable row of related ProductCards filtered by category, falling back to other products if none match, with skeleton loading states.",
  "frontend/src/components/Reviews.tsx": "Static testimonials section rendering a grid of four customer review cards with star ratings, review text, reviewer name, and associated product.",
  "frontend/src/context/CartContext.tsx": "React context providing global cart state and actions (add, remove, update quantity, clear) along with computed values like subtotal, item count, and free shipping progress.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an ICP backend actor using React Query, supporting both anonymous and authenticated identities, and invalidates dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an InternetIdentityProvider and useInternetIdentity hook for managing Internet Identity authentication state, including login, logout, and identity persistence via AuthClient.",
  "frontend/src/hooks/useIntersectionObserver.ts": "Custom hook that uses IntersectionObserver to track whether a referenced element is in the viewport, with configurable threshold, rootMargin, and triggerOnce options.",
  "frontend/src/hooks/useMutations.ts": "Exports React Query mutation hooks for CRUD operations on products, categories, collections, and orders, each invalidating the relevant query cache on success.",
  "frontend/src/hooks/useQueries.ts": "Exports React Query hooks for fetching products, categories, collections, orders, and admin status from the ICP backend actor, with appropriate enabled guards for authentication state.",
  "frontend/src/hooks/useScrollPosition.ts": "Custom hook that tracks the window's vertical scroll position using a requestAnimationFrame-throttled scroll event listener.",
  "frontend/src/index.css": "Global stylesheet that imports Barlow fonts, configures Tailwind, defines CSS custom properties for the dark Beast Ride theme, and declares reusable component classes like beast-btn and metal-text.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app with QueryClientProvider and InternetIdentityProvider wrapping the root App component.",
  "frontend/src/pages/Admin.tsx": "Admin dashboard page that handles Internet Identity authentication, verifies admin status, and renders section-based admin UI (orders, products, categories) with loading and access-denied states.",
  "frontend/src/pages/Collection.tsx": "Shop collection page that displays all products in a filterable grid, supporting category filtering via URL search params and a sidebar component.",
  "frontend/src/pages/Home.tsx": "Home page that composes the main landing sections: hero, category split, featured products carousel, performance highlight, cinematic parallax, reviews, and Instagram community.",
  "frontend/src/pages/OrderConfirmation.tsx": "Order confirmation page that reads order data from sessionStorage and displays a success summary including order ID, customer info, items, and payment method.",
  "frontend/src/pages/ProductDetail.tsx": "Product detail page that fetches a single product by ID, displays its image and info, supports quantity selection and add-to-cart, and shows related products and tabs.",
  "frontend/src/utils/urlParams.ts": "Utility module providing helper functions to read, store, retrieve, and clear URL parameters from both query strings and hash-based routes, with sessionStorage persistence support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration for the frontend, extending the default theme with custom brand colors (Beast Ride tokens), fonts, shadows, animations, and enabling dark mode, typography, container queries, and animate plugins.",
  "project_state.json": "Tracks the current project state (version 3), documenting a known admin access-denied bug, an existing frontend fix feature, and a pending backend fix request (AR-1) to correct admin principal comparison in the AccessControl mixin."
}