{
  "backend/main.mo": "Main Motoko actor for the BEAST RIDE backend, defining data types and CRUD operations for products, categories, collections, orders, and user profiles, with admin/user access control via mixins.",
  "feature_evidence.json": "Empty feature evidence report JSON file with no features listed.",
  "frontend-file-summaries.txt": "JSON document containing short summaries of all frontend source files, describing each component, hook, page, and config file's purpose in the BEAST RIDE app.",
  "frontend/index.css": "Root CSS file that sets up Tailwind directives and defines OKLCH-based CSS custom properties for light and dark theme color tokens including background, foreground, sidebar, chart, and destructive colors.",
  "frontend/index.html": "Minimal HTML entry point for the BEAST RIDE frontend, mounting the React app into a root div and loading the main TypeScript module.",
  "frontend/src/App.tsx": "Root React component that sets up TanStack Router with routes for Home, Collection, ProductDetail, Admin, and OrderConfirmation pages, all wrapped in CartProvider and Layout.",
  "frontend/src/components/admin/CategoriesCollectionsSection.tsx": "Admin panel section for managing categories and collections, including CRUD operations and product assignment to collections via inline forms and confirmation dialogs.",
  "frontend/src/components/admin/GoogleLoginScreen.tsx": "Renders a styled admin login screen with a Google sign-in button using Internet Identity, showing loading and error states.",
  "frontend/src/components/admin/OrdersSection.tsx": "Admin orders table displaying all orders with customer details, address, items, payment method, and a dropdown to update order status.",
  "frontend/src/components/admin/ProductFormModal.tsx": "Modal form for adding or editing a product, with fields for name, price, description, category, image, and inventory, using add/update mutations.",
  "frontend/src/components/admin/ProductsSection.tsx": "Admin products table listing all products with image, name, category, price, and inventory, supporting add, edit, and delete actions via a modal and confirmation dialog.",
  "frontend/src/components/admin/ResetAdminDialog.tsx": "Empty file with no content.",
  "frontend/src/components/AdminGuard.tsx": "Pass-through wrapper component that previously guarded admin routes but now delegates all authentication and authorization to the Admin page itself.",
  "frontend/src/components/AdminSidebar.tsx": "Sticky admin sidebar with navigation items for Orders, Products, and Categories/Collections, active-state highlighting, principal display, and a logout button.",
  "frontend/src/components/AnimatedSection.tsx": "Wrapper component that triggers a fade-in-up CSS animation when the section enters the viewport, with optional transition delay support.",
  "frontend/src/components/CartDrawer.tsx": "Slide-in cart drawer component handling multi-step checkout flow including cart review, shipping form with validation, payment method selection, and order creation via backend mutation.",
  "frontend/src/components/CategorySplit.tsx": "Renders a two-panel split section for 'Bike Accessories' and 'Car Performance' categories, each with an image, gradient overlay, animated border, and a navigation link to the filtered shop page.",
  "frontend/src/components/CheckoutStepIndicator.tsx": "Displays a two-step checkout progress indicator (Shipping and Payment) with completed, active, and inactive visual states using icons and colored borders.",
  "frontend/src/components/CinematicParallax.tsx": "Renders a full-width parallax banner section with a night-road background image, dark overlay, and an animated 'DOMINATE THE ROAD' heading that triggers on scroll into view.",
  "frontend/src/components/FeaturedProductsCarousel.tsx": "A horizontally scrollable product carousel fetching all products via a query hook, supporting touch swipe and prev/next navigation with scale and opacity effects based on the active index.",
  "frontend/src/components/FilterSidebar.tsx": "A sidebar component that renders a category filter list (All, Bike Accessories, Car Performance) with active state highlighting and an onChange callback.",
  "frontend/src/components/Footer.tsx": "Site footer with a logo, three-column layout for Shop links, Support items, and social media icon buttons, plus a copyright line at the bottom.",
  "frontend/src/components/Header.tsx": "Fixed top navigation header that transitions styling on scroll, includes desktop nav links, a cart icon with item count badge, and a hamburger menu that opens a MobileNav drawer.",
  "frontend/src/components/HeroSection.tsx": "Full-viewport hero section with a background image, gradient overlays, a pulsing red glow, headline text, subtext, and a 'Shop Performance' CTA button navigating to the shop page.",
  "frontend/src/components/InstagramCommunity.tsx": "Displays a community section with a heading and a 2x4 grid of Instagram-style community images, each with an Instagram icon overlay on hover.",
  "frontend/src/components/Layout.tsx": "Root layout wrapper that composes Header, Footer, CartDrawer, and a Toaster notification component around page children with a dark background.",
  "frontend/src/components/MobileNav.tsx": "Slide-in mobile navigation drawer with an overlay, site logo, close button, and links to main shop categories.",
  "frontend/src/components/PaymentMethodSelector.tsx": "Radio-style selector component for choosing between COD, UPI, and Card payment methods with styled active/inactive states.",
  "frontend/src/components/PerformanceHighlight.tsx": "Marketing section displaying three animated feature cards (Speed, Durability, Rider Approval) with custom SVG icons under a 'Built Different' heading.",
  "frontend/src/components/ProductCard.tsx": "Card component displaying a product image, category, name, price, and an add-to-cart button, navigating to the product detail page on click.",
  "frontend/src/components/ProductTabs.tsx": "Tabbed panel for a product detail page showing Description, Specifications, and Shipping info with an animated active-tab indicator.",
  "frontend/src/components/RelatedProducts.tsx": "Horizontally scrollable row of ProductCards filtered by the same category as the current product, with skeleton loading states.",
  "frontend/src/components/Reviews.tsx": "Static testimonials section rendering a grid of four customer review cards with star ratings, review text, and product references.",
  "frontend/src/context/CartContext.tsx": "React context providing cart state and actions (add, remove, update quantity, clear, open/close) along with computed subtotal, item count, and free shipping progress.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor instance using React Query, supporting both anonymous and authenticated (Internet Identity) usage, and invalidates dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an Internet Identity authentication context and provider, exposing login/logout functions, identity state, and login status via a React context hook.",
  "frontend/src/hooks/useIntersectionObserver.ts": "A generic React hook that uses IntersectionObserver to track whether a referenced element is in the viewport, with configurable threshold, rootMargin, and triggerOnce options.",
  "frontend/src/hooks/useMutations.ts": "Exports React Query mutation hooks for backend write operations including admin access, order status updates, and CRUD operations for products and categories.",
  "frontend/src/hooks/useQueries.ts": "Exports React Query hooks for fetching backend data including products, categories, collections, orders, and admin status checks.",
  "frontend/src/hooks/useScrollPosition.ts": "A React hook that tracks the window's vertical scroll position using a requestAnimationFrame-throttled scroll event listener.",
  "frontend/src/index.css": "Global stylesheet defining Tailwind base/components/utilities, CSS custom properties for the dark 'Beast Ride' theme, and reusable component classes like beast-btn and metal-text with animations.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app with QueryClientProvider and InternetIdentityProvider wrappers around the root App component.",
  "frontend/src/pages/Admin.tsx": "Admin dashboard page that handles Internet Identity authentication, admin status verification, and renders section-based admin UI (orders, products, categories) with a sidebar. Also supports bootstrapping the first admin via a claim-access flow.",
  "frontend/src/pages/AdminLogin.tsx": "Empty file with no content.",
  "frontend/src/pages/Collection.tsx": "Product collection/shop page that displays all products in a grid with category filtering via a sidebar, reading the initial category from URL search params.",
  "frontend/src/pages/Home.tsx": "Home page that composes multiple section components (hero, category split, featured carousel, performance highlight, parallax, reviews, Instagram community) into a single landing page.",
  "frontend/src/pages/OrderConfirmation.tsx": "Order confirmation page that reads order data from sessionStorage and displays a summary of the confirmed order including items, address, payment method, and totals.",
  "frontend/src/pages/ProductDetail.tsx": "Product detail page that fetches and displays a single product by ID with image, description, quantity selector, add-to-cart functionality, tabs, and related products.",
  "frontend/src/utils/urlParams.ts": "Utility module providing helper functions to read, store, retrieve, and clear URL parameters from both query strings and hash-based routes, with optional sessionStorage persistence.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration for the frontend, extending the theme with custom brand colors (Beast Ride tokens), fonts, shadows, keyframe animations, and integrating typography, container-queries, and animate plugins.",
  "project_state.json": "Project state metadata file tracking schema version, feature requests, and configuration flags; currently initialized as a new empty project with no features or issues recorded."
}