{
  "backend/main.mo": "Main Motoko actor for the BEAST RIDE backend, defining data types and CRUD operations for products, categories, collections, orders, and user profiles, with role-based access control via MixinAuthorization and blob storage support.",
  "backend/migration.mo": "Minimal migration module with empty OldActor and NewActor types and a no-op run function that passes the old state through unchanged.",
  "feature_evidence.json": "Feature evidence report mapping two admin-access-related features (Reset Admin Access button and claimed-admin error handling) to their implementing files, components, and test IDs.",
  "frontend-file-summaries.txt": "Text file containing short summaries of all frontend source files, describing each component's purpose, styling approach, and key functionality for build planning reference.",
  "frontend/index.css": "Base Tailwind CSS entry point defining OKLCH-based CSS custom properties for light and dark theme color tokens including background, foreground, sidebar, chart, and destructive colors.",
  "frontend/index.html": "Minimal HTML shell for the BEAST RIDE React app, mounting the app at #root and loading the main.tsx module entry point.",
  "frontend/src/App.tsx": "Root React component that sets up TanStack Router with routes for Home, Shop, ProductDetail, AdminLogin, Admin (guarded), and OrderConfirmation, all wrapped in CartProvider and Layout.",
  "frontend/src/components/admin/CategoriesCollectionsSection.tsx": "Admin panel section for managing categories and collections, providing CRUD forms and product assignment/removal for collections using React Query hooks.",
  "frontend/src/components/admin/GoogleLoginScreen.tsx": "Renders a styled admin login screen with a Google sign-in button, loading state, and error display for Internet Identity-based authentication.",
  "frontend/src/components/admin/OrdersSection.tsx": "Admin orders table that lists all orders with customer details, address, items, payment method, and a dropdown to update order status via mutation hooks.",
  "frontend/src/components/admin/ProductFormModal.tsx": "Modal form for adding or editing a product, with fields for name, price, description, category, image, and inventory, validated before submitting via React Query mutations.",
  "frontend/src/components/admin/ProductsSection.tsx": "Admin products table that lists all products with image, name, category, price, and inventory, and supports adding, editing, and deleting products through modals and alert dialogs.",
  "frontend/src/components/admin/ResetAdminDialog.tsx": "A confirmation alert dialog component for resetting admin access, showing a warning message and a confirm/cancel button pair with a loading state during the reset operation.",
  "frontend/src/components/AdminGuard.tsx": "Route guard component that checks sessionStorage for adminAuthenticated flag and redirects unauthenticated users to /admin-login, rendering children only when authenticated.",
  "frontend/src/components/AdminSidebar.tsx": "Sticky admin sidebar with navigation items for Orders, Products, and Categories/Collections, a logout handler that clears session storage and redirects, and a truncated principal display.",
  "frontend/src/components/AnimatedSection.tsx": "Wrapper component that applies a fade-in-up CSS animation when the element enters the viewport using useIntersectionObserver, with optional transition delay support.",
  "frontend/src/components/CartDrawer.tsx": "A multi-step cart drawer component handling item quantity management, shipping address form with validation, payment method selection, and order creation via a checkout flow.",
  "frontend/src/components/CategorySplit.tsx": "Displays a two-panel split section for 'Bike Accessories' and 'Car Performance' categories with images and navigation links to the shop filtered by category.",
  "frontend/src/components/CheckoutStepIndicator.tsx": "Renders a two-step checkout progress indicator (Shipping and Payment) with visual states for active, completed, and inactive steps.",
  "frontend/src/components/CinematicParallax.tsx": "A parallax hero section with a background road image, dark overlay, and an animated headline that triggers on intersection with the viewport.",
  "frontend/src/components/FeaturedProductsCarousel.tsx": "A touch-enabled product carousel showcasing featured products with scale/opacity effects, navigation arrows, and add-to-cart functionality.",
  "frontend/src/components/FilterSidebar.tsx": "A sidebar component that renders category filter buttons (All, Bike Accessories, Car Performance) with active state highlighting.",
  "frontend/src/components/Footer.tsx": "Site footer with shop links, support links, and social media icon buttons organized in a three-column grid layout.",
  "frontend/src/components/Header.tsx": "Fixed top navigation header with logo, desktop nav links, a cart icon with item count badge, and a mobile hamburger menu that toggles MobileNav.",
  "frontend/src/components/HeroSection.tsx": "Full-viewport hero section with a background image, gradient overlays, animated red glow, headline text, and a 'Shop Performance' CTA button that navigates to /shop.",
  "frontend/src/components/InstagramCommunity.tsx": "Displays a 4-image community photo grid with Instagram icon overlays and an animated section header encouraging users to tag @beastride.",
  "frontend/src/components/Layout.tsx": "Root layout wrapper that composes the Header, Footer, CartDrawer, and Toaster around page children with a dark background.",
  "frontend/src/components/MobileNav.tsx": "Slide-in mobile navigation drawer with an overlay, logo, close button, and links to Home, Shop All, and category pages.",
  "frontend/src/components/PaymentMethodSelector.tsx": "Renders a list of selectable payment method buttons (COD, UPI, Card) with radio indicators and icons, calling onMethodChange on selection.",
  "frontend/src/components/PerformanceHighlight.tsx": "Marketing section displaying three animated feature cards (Speed, Durability, Rider Approved) with custom SVG icons and hover border effects.",
  "frontend/src/components/ProductCard.tsx": "Displays a single product's image, category, name, price, and an add-to-cart button; clicking the card navigates to the product detail page.",
  "frontend/src/components/ProductTabs.tsx": "Tabbed UI for a product detail page with three tabs—Description, Specifications, and Shipping—featuring an animated active-tab indicator.",
  "frontend/src/components/RelatedProducts.tsx": "Fetches all products and renders a horizontally scrollable row of up to 6 related ProductCards filtered by category, with skeleton loading states.",
  "frontend/src/components/Reviews.tsx": "Displays a grid of four hardcoded customer testimonials with star ratings, review text, reviewer name, and product name, wrapped in animated sections on a dark background.",
  "frontend/src/context/CartContext.tsx": "React context provider that manages shopping cart state including items, quantities, open/close state, subtotal, item count, and free shipping progress threshold.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an authenticated or anonymous ICP backend actor using React Query, initializing access control with an admin token when authenticated and invalidating dependent queries on actor change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Custom hook and provider for Internet Identity authentication on ICP, managing AuthClient lifecycle, login/logout flows, and exposing identity state and status flags via React context.",
  "frontend/src/hooks/useIntersectionObserver.ts": "Custom hook that uses IntersectionObserver to track whether a referenced DOM element is in the viewport, with configurable threshold, root margin, and trigger-once behavior.",
  "frontend/src/hooks/useMutations.ts": "Collection of React Query mutation hooks for backend write operations including claiming admin access, updating order status, and CRUD operations for products and categories.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for fetching backend data including products, categories, collections, orders, and admin status checks, all gated on actor readiness.",
  "frontend/src/hooks/useScrollPosition.ts": "Custom hook that tracks the window's vertical scroll position using a requestAnimationFrame-throttled scroll event listener.",
  "frontend/src/index.css": "Global stylesheet that imports Barlow fonts, sets up Tailwind layers, defines CSS custom properties for the Beast Ride dark theme, and declares reusable component classes like beast-btn, metal-text, and red-glow animations.",
  "frontend/src/main.tsx": "React app entry point that wraps the App component with TanStack QueryClientProvider and a custom InternetIdentityProvider before mounting to the DOM.",
  "frontend/src/pages/Admin.tsx": "Admin dashboard page that handles Internet Identity authentication, admin access claiming/resetting, and renders section-based content (orders, products, categories) via a sidebar navigation.",
  "frontend/src/pages/AdminLogin.tsx": "Hardcoded credential login form for the admin portal that stores authentication state in sessionStorage and redirects to the admin dashboard on success.",
  "frontend/src/pages/Collection.tsx": "Product collection page that fetches all products, filters them by category from URL search params, and displays them in a responsive grid with a filter sidebar and loading skeletons.",
  "frontend/src/pages/Home.tsx": "Home page component that composes the landing page by rendering Hero, CategorySplit, FeaturedProductsCarousel, PerformanceHighlight, CinematicParallax, Reviews, and InstagramCommunity sections in sequence.",
  "frontend/src/pages/OrderConfirmation.tsx": "Order confirmation page that reads order data from sessionStorage and displays a success screen with order ID, customer details, itemized summary, and payment method.",
  "frontend/src/pages/ProductDetail.tsx": "React page component that displays a single product's details (image, category, title, price, quantity selector, add-to-cart) fetched by ID from the URL, with loading skeletons and a not-found fallback.",
  "frontend/src/utils/urlParams.ts": "Utility module providing helper functions to read URL query parameters (supporting both standard and hash-based routing), persist them to sessionStorage, and clean sensitive params from the URL hash.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining the project's design tokens including Beast Ride brand colors, custom fonts (Barlow Condensed/Barlow), box shadows, and keyframe animations, with plugins for typography, container queries, and animate.",
  "project_state.json": "Project state metadata tracking existing features, pending feature requests, known issues, and versioning for the Beast Ride Admin app, specifically around admin principal reset functionality."
}