{
  "kind": "build_request",
  "title": "Restrict admin panel login to Google authenticator (Internet Identity with Google)",
  "projectName": "Beast Ride Admin",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "On the Admin page, display a login screen that instructs users to sign in exclusively via Internet Identity using Google as the authentication method. The login button should trigger Internet Identity's Google login flow. Any other login options (passkeys, other providers) should not be presented on the admin login screen.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-recent"
        ],
        "quotes": [
          "amin panel only can login throuugh google authenticater coe"
        ]
      },
      "acceptanceCriteria": [
        "The admin login screen shows a single 'Sign in with Google' button that launches Internet Identity.",
        "Unauthenticated users cannot access any admin content — they are shown only the login screen.",
        "After successful Google-based Internet Identity login, the user is granted access to the admin dashboard.",
        "No passkey or other provider login options are presented on the admin login page."
      ]
    },
    {
      "id": "REQ-2",
      "text": "In the backend Motoko actor, enforce that all admin operations (product CRUD, order management, category/collection management) validate the caller's principal before executing. Only principals that have previously been registered as admins (or the initial deployer) should be permitted to call admin-only functions.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-recent"
        ],
        "quotes": [
          "amin panel only can login throuugh google authenticater coe"
        ]
      },
      "acceptanceCriteria": [
        "Admin-only backend functions reject calls from anonymous or unauthorized principals with an error.",
        "The initial deployer principal is automatically granted admin access.",
        "A mechanism exists to whitelist additional admin principals.",
        "Non-admin callers receive a clear authorization error rather than partial data."
      ]
    }
  ],
  "constraints": [
    "Authentication must use Internet Identity — traditional email/password is not supported on this platform.",
    "Do not modify files in frontend/src/hooks/useInternetIdentity.ts or frontend/src/hooks/useActor.ts.",
    "Do not modify files under frontend/src/components/ui."
  ],
  "nonGoals": [
    "Email and password authentication.",
    "Support for non-Google login providers on the admin panel.",
    "Any changes to the customer-facing storefront authentication flow."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}