{
  "kind": "build_request",
  "title": "Add admin principal reset functionality",
  "projectName": "Beast Ride Admin",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Add a backend function `resetAdminPrincipal` that clears the stored admin principal ID, allowing a new principal to claim admin access. This function should only be callable by the current admin principal or, if no valid admin exists, should allow a forced reset via a secure mechanism (e.g., a one-time reset flag or hardcoded canister controller check).",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-3"
        ],
        "quotes": [
          "rest principle id so that i can claim rmove aold ppriciple iad"
        ]
      },
      "acceptanceCriteria": [
        "A `resetAdminPrincipal` function exists in the backend actor that clears the stored admin principal.",
        "After calling reset, the admin claim endpoint succeeds for a new principal.",
        "The reset function is protected so it cannot be called arbitrarily by any anonymous user."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Add a 'Reset Admin Access' button on the Admin dashboard page (`frontend/src/pages/Admin.tsx`) that calls the `resetAdminPrincipal` backend function and then immediately allows the current logged-in principal to re-claim admin access. Display a confirmation dialog before executing the reset to prevent accidental use.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-3"
        ],
        "quotes": [
          "rest principle id so that i can claim rmove aold ppriciple iad"
        ]
      },
      "acceptanceCriteria": [
        "A 'Reset Admin Access' button is visible in the admin dashboard UI.",
        "Clicking the button shows a confirmation dialog warning the user that current admin access will be revoked.",
        "On confirmation, the reset mutation is called and the current principal can immediately claim admin again.",
        "Success and error states are communicated to the user via toast notifications.",
        "The button is only shown when the user is authenticated via Internet Identity."
      ]
    },
    {
      "id": "REQ-3",
      "text": "On the Admin page (`frontend/src/pages/Admin.tsx`), when the 'Admin access has already been claimed' error is encountered and the user is authenticated, display a user-friendly message explaining the situation and show an option to reset admin access rather than a dead-end error state.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-3"
        ],
        "quotes": [
          "Admin access has already been claimed. Contact the system administrator."
        ]
      },
      "acceptanceCriteria": [
        "When the claim-admin mutation returns an 'already claimed' error, the UI shows a clear explanation message.",
        "A 'Reset Admin Access' action is presented inline on this error state.",
        "The user is not stuck at a dead-end error with no recovery path."
      ]
    }
  ],
  "constraints": [
    "Do not modify files under frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, or frontend/src/components/ui.",
    "All backend changes must remain within the single actor in backend/main.mo.",
    "The reset mechanism must not allow completely anonymous/unauthenticated callers to reset admin access without any authorization."
  ],
  "nonGoals": [
    "Replacing the Internet Identity authentication flow.",
    "Adding multiple admin roles or role-based access control.",
    "Changing the existing admin login page (AdminLogin.tsx) credentials."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}