{
  "kind": "build_request",
  "title": "Fix admin privilege access denied error",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Investigate and fix the backend admin access control logic so that the correct authenticated principal is recognized as an admin. The current behavior causes 'Access denied. Your account does not have admin privileges.' when a legitimate admin attempts to access the admin panel. Review how admin principals are stored and compared in the AccessControl mixin in backend/main.mo, and ensure the principal used for comparison matches the authenticated caller's principal exactly.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Access denied. Your account does not have admin privileges."
        ]
      },
      "acceptanceCriteria": [
        "An authenticated admin user can access the admin panel without receiving an 'Access denied' error.",
        "The backend admin guard correctly identifies the calling principal as an admin when it should.",
        "Non-admin principals are still correctly denied access."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Ensure the frontend admin dashboard in frontend/src/pages/Admin.tsx and frontend/src/components/admin/OrdersSection.tsx correctly passes the authenticated identity when calling admin-only backend methods. Verify that the actor used for admin queries is always the authenticated actor (not anonymous), and that query/mutation hooks in useQueries.ts and useMutations.ts are enabled only when a valid authenticated identity is present.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Access denied. Your account does not have admin privileges."
        ]
      },
      "acceptanceCriteria": [
        "Admin queries and mutations are only triggered when the user is authenticated via Internet Identity.",
        "The authenticated actor (not anonymous) is used for all admin panel API calls.",
        "The admin panel displays orders, products, and categories successfully after login without authorization errors."
      ]
    }
  ],
  "constraints": [
    "Do not modify files under frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, or frontend/src/components/ui.",
    "Preserve the single-actor architecture in backend/main.mo."
  ],
  "nonGoals": [
    "Adding new admin features or changing the admin UI layout.",
    "Changing the authentication provider from Internet Identity.",
    "Modifying non-admin user flows."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}