{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Restrict Admin Panel Login to Google Authenticator (Internet Identity with Google)",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Display a Google-only login screen on the Admin page that restricts authentication to Internet Identity using Google, blocking access to unauthenticated users and hiding all other login provider options.",
      "acceptanceCriteria": [
        "The admin login screen shows a single 'Sign in with Google' button that launches Internet Identity.",
        "Unauthenticated users cannot access any admin content — they are shown only the login screen.",
        "After successful Google-based Internet Identity login, the user is granted access to the admin dashboard.",
        "No passkey or other provider login options are presented on the admin login page."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/Admin.tsx",
          "operation": "modify",
          "description": "Replace the current authentication flow with a dedicated login screen that only presents a 'Sign in with Google' button. Use the useInternetIdentity hook to trigger login with Google-specific parameters. Gate all admin dashboard content behind successful authentication. Ensure the login screen is the only visible content when the user is not authenticated. After successful login, display the existing admin sections (sidebar, orders, products, categories/collections)."
        },
        {
          "path": "frontend/src/components/admin/GoogleLoginScreen.tsx",
          "operation": "create",
          "description": "Create a centered login screen component that displays a branded 'Sign in with Google' button. The button should call the Internet Identity login flow with Google as the required authentication method. Include clear messaging that admin access requires Google authentication via Internet Identity. Style the component consistently with the Beast Ride dark theme (red accents, dark background). Show a loading state while login is in progress. Handle login errors gracefully with user-friendly error messages."
        }
      ]
    }
  ]
}