{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Add admin principal reset functionality",
  "requirements": [
    {
      "id": "REQ-2",
      "summary": "Add a 'Reset Admin Access' button on the Admin dashboard that calls the reset backend function and allows re-claiming admin access with a confirmation dialog",
      "acceptanceCriteria": [
        "A 'Reset Admin Access' button is visible in the admin dashboard UI.",
        "Clicking the button shows a confirmation dialog warning the user that current admin access will be revoked.",
        "On confirmation, the reset mutation is called and the current principal can immediately claim admin again.",
        "Success and error states are communicated to the user via toast notifications.",
        "The button is only shown when the user is authenticated via Internet Identity."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useMutations.ts",
          "operation": "modify",
          "description": "Add a useResetAdminPrincipal mutation hook that calls the backend resetAdminPrincipal function and invalidates admin-related queries on success. The mutation should handle success/error states and return a mutate function for the UI to invoke."
        },
        {
          "path": "frontend/src/pages/Admin.tsx",
          "operation": "modify",
          "description": "Add a 'Reset Admin Access' button in the admin dashboard UI (visible only when authenticated). On click, show a confirmation dialog warning the user that current admin access will be revoked. On confirmation, call the resetAdminPrincipal mutation, then immediately call claimAdminAccess mutation to re-claim admin with the current principal. Display toast notifications for success and error states. Position the button prominently in the dashboard header or sidebar area."
        },
        {
          "path": "frontend/src/components/admin/ResetAdminDialog.tsx",
          "operation": "create",
          "description": "Create a reusable confirmation dialog component for the admin reset action. The dialog should display a warning message explaining that resetting will revoke current admin access and require re-claiming. Include 'Cancel' and 'Confirm Reset' buttons. Use shadcn/ui Dialog component primitives for consistent styling. Accept onConfirm and onCancel callbacks as props."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Display a user-friendly message and reset option when the 'Admin access has already been claimed' error occurs on the Admin page",
      "acceptanceCriteria": [
        "When the claim-admin mutation returns an 'already claimed' error, the UI shows a clear explanation message.",
        "A 'Reset Admin Access' action is presented inline on this error state.",
        "The user is not stuck at a dead-end error with no recovery path."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/Admin.tsx",
          "operation": "modify",
          "description": "Update the error handling logic for the claimAdminAccess mutation to detect 'Admin access has already been claimed' errors. When this specific error occurs and the user is authenticated, display a user-friendly explanation message (e.g., 'Admin access has already been claimed by another principal. You can reset admin access to reclaim it with your current identity.') and show the 'Reset Admin Access' button inline within the error state UI. Reuse the ResetAdminDialog component for the reset confirmation flow."
        }
      ]
    }
  ]
}